package com.jiuyv.yl.console.lottery.batch;

import java.util.ArrayList;
import java.util.List;

public class NotifyMessage {
	private static List<String> message = new ArrayList<String>();
	
	static {
		message.add("考研是自己选择的最愿意去走的道路，不管前面会遇到什么，考研的决心一旦作出就要义无反顾、勇往直前。");
		message.add("天将降大任于斯人也，必先苦其心志，劳其筋骨，为了自己的目标，必须付出许多代价才能达到，没有天上掉下来的馅饼!");
		message.add("当一切成为过去的时候，你对过去就会不以为然了。所以我相信只要你对未来有梦想，并且踏踏实实的走过为将来奋斗的路，你会收获很多的。所以我祝愿所有拥有自己梦想的朋友，选择了就义无返顾的坚持下去，这样在不久的将来，回收获微笑的!");
		message.add("考研是我证明自己价值的最直接的路，是我改变自己现在生活状态的捷径，是我真正体验高校生活的唯一的路。");
		message.add("人生路多歧，有舍取，有所为；有所不为，才能大有所为。");
		message.add("一个人生活中的失意乃至失败在很大程度上来说是心理的而不是现实的，是技术性的而不是宿命的。现实至多为失败者提供了解脱的借口，而对宿命的信仰最终无情地扑灭了成功的任何希望。");
		message.add("千万别摸着石头过河，要清楚最终追求是什么，究竟想成为什么样的人，当别人都迷迷糊糊的时候，你千万别也迷迷糊糊的。");
		message.add("伟人之所以伟大，是因为他与别人共处逆境时，别人失去了信心，他却下决心实现自己的目标。");
		message.add("人生有五颜六色的价值观，但一种价值观一旦被你认可，你就可能一辈子追求这个价值观而无怨无悔；世界有千紫万红的思想，但你只要接受其中一种，你就能够终生信奉它而至死不逾。");
		message.add("当你感到悲哀痛苦时，最好是去学些什么东西。");
		message.add("学习会使你永远立于不败之地。");
		message.add("每个人总会经历许许多多的失意与挫折，但当这些降临到你身上时，千万不要放弃。永远不要忘记你儿时的梦想，只有心中怀揣着火热的梦想时，人生才是美丽的。往往你会发现，当你坚持到最后时，一切的失意都会被成功的幸福所替代。");
		message.add("对于年轻人而言，最重要的品质是诚实正直，这是做成大事的基础；其次是分析问题的方法，如何全面、有前瞻性地分析问题，不走弯路，是取得成功的关键；最后是技能，不断地学习挑战自己，增加自己的价值是作为一个人应当不断追求的目标。");
		message.add("坚持是世界上最简单的事，因为只要你自己愿意去坚持就没有人可以阻止你，不让你去坚持；但坚持又是世界上最难的事，因为坚持到最后的人一定是少数——就是成功者。其实人都有惰性，成功者与失败者的差异就在于成功者能够在做事的过程中找到一种东西来克服自己的惰性而坚持自己的目标，但失败者却不能。");
		message.add("在你生命中确有一个你所喜欢的目标，然后就朝着目标勇往直前。当你把你的一切都投入到你所喜欢的事业上时，你会发现，你所渴望的机会一个接一个全都掌握了。就如同珊瑚静止在水中，它所需要的原生物却不断地送上门来。");
		message.add("人的发展历程就像爬山，每登上一个高度都能看到更远更美的风景。很多人留恋眼前的风景，不愿继续努力前行。只有一少部分人，才敢于向上攀登。只有这些人才能到达那些更高更远的风景，也只有这些人才能体会到如果当初停下脚步会留下多少遗憾。只有他们能够居高临下地看待下面的登山者。");
		message.add("把你的手举过你的头顶，你会发现你的手总比你的头要高，说明做事情总比想事情重要，实实在在的去做些什么吧!");
		message.add("无论在失意的时候还是得意的时候，我总是用下面的寓言来激励自己:静谧的非洲大草原上，夕阳西下，这时，一头狮子在沉思，明天当太阳升起，我要奔跑，以追上跑得最快的羚羊；此时，一只羚羊也在沉思，明天当太阳升起，我要奔跑，以逃脱跑得最快的狮子。那么，无论你是狮子或是羚羊，当太阳升起，你要做的，就是奔跑!");
		message.add("欲望以提升热忱，毅力以磨平高山。");
		message.add("一个能从别人的观念来看事情，能了解别人心灵活动的人永远不必为自己的前途担心。");
		message.add("如果寒暄只是打个招呼就了事的话，那与猴子的呼叫声有什么不同呢?事实上，正确的寒暄必须在短短一句话中明显地表露出你对他的关怀。");
		message.add("只有一条路不能选择——那就是放弃的路；只有一条路不能拒绝——那就是成长的路。");
		message.add("如果缺少破土面出并与风雪拚搏的勇气，种子的前途并不比落叶美妙一分。");
		message.add("蜗牛一步一步往上爬，我会有我的明天。");
		message.add("考研是一项伟大的工程，它是对人的意志力，判断力，交际力等综合能力的考验。");
		message.add("生命之中最快乐的是拼搏，而非成功，生命之中最痛苦的是懒散，而非失败。");
		message.add("这是我一直追寻的目标。");
		message.add("只要不放弃努力和追求，小草也有点缀春天的价值。");
		message.add("如果可恨的挫折使你尝到苦果，朋友，奋起必将让你尝到人生的欢乐。");
		message.add("我不在乎你过去作什么，只在乎你现在干什么!");
		message.add("当你感到悲哀痛苦时，最好是去学些什么东西。学习会使你永远立于不败之地。");
		message.add("人生起落以意志勇怯而定。——安奈斯·妮恩");
		message.add("今天能够做的事，切莫拖延到明天");
		message.add("一时的挫折往往可以通过不屈的搏击，变成学问及见识。");
		message.add("勤奋是成功的可靠保证");
		message.add("人必须要在耐心，特别是要有信心。");
		message.add("昨日梦见了犹豫，达到理想不太易，即使有信心，斗志却抑制!");
		message.add("在茫茫沙漠，唯有前时进的脚步才是希望的象征。(家具广告)");
		message.add("人不可像走兽那样活着，应该追求知识和美德。");
		message.add("在一个人奋斗的道路上，你也许会孤单寂寞，可是别忘了，朋友的祝福还在，父母的叮咛还在，对希望的追求还在，至少你的信仰还在。那么再苦再累算什么，你将永远不会孤独，你将永远的走下去。");
		message.add("书到用时方恨少，事非经过不知难。");
		message.add("任何成就都是刻苦劳动的结果。");
		message.add("只有脚踏实地的人，才能够说：路，就在我的脚下。");
		message.add("让珊瑚远离惊涛骇浪的侵蚀吗?那无异是将它们的美丽葬送。");
		message.add("用习惯和智慧创造奇迹，用理想和信心换取动力。");
		message.add("天将降大任于斯人也，必先苦其心志，劳其筋骨，为了自己的目标，必须付出许多代价才能达到，没有天上掉下来的馅饼!");
		message.add("说穿了，其实提高成绩并不难，就看你是不是肯下功夫积累——多做题，多总结。");
		message.add("我可以放弃一切，但决不放弃考研;我可以坚持一切，但绝不给懒惰找借口。不求做给谁看，但求问心无愧。到时候，只希望自己可以没有愧疚的说一句：我尽力了!");
		message.add("每个月月底一个大休，周日适当休息，其余时间按计划进行，雷打不动，即使下冰雹，哪怕下刀子，去上自习!");
		message.add("不要自卑，你不比别人笨。不要自满，别人不比你笨。");
		message.add("不必每分钟都学习，但求学习中每分钟都有收获。");
		message.add("一个能思考的人，才真是一个力量无边的人。");
		message.add("只有正视自己的无知，才能扩大自己的知识。");
		message.add("想过成功，想过失败，但从没想过放弃。");
		message.add("考研不简单，实现自己的梦想也不容易，但是!不代表不可能，坚持，忍耐，拼搏，进入清华没有问题!");
		message.add("就一年，拼搏成功了，以后年跻身上层社会。懈怠失败了，像农民工一样，一个月一两千，面临耻辱。");
		message.add("男儿何不带吴钩，收取关山五十州!");
		message.add("欲以一身撼天下，须于平地起波澜。");
		message.add("黄沙百战穿金甲，不破楼兰终不还!");
		message.add("有志者，事竟成，破釜沉舟，百二秦关终属楚;苦心人，天不负，卧薪尝胆，三千越甲可吞吴!");
		message.add("为什么当初不好好珍惜时间，现在真的一切都晚了，再后悔还来得及吗?今天，把握好今天!");
		message.add("想想再过一年，你回到家，给他们带来的不是成功的喜悦，而而是告诉他们，考得不好，那么这个寒假，你将要怎么去度过?想想清楚吧!");
		message.add("我不去想是否能够成功，既然选择了远方，便只顾风雨兼程;我不去想，身后会不会袭来寒风冷雨，既然目标是地平线，留给世界的只能是背影!");
		message.add("竹笋虽然柔嫩，但它不怕重压，敢于奋斗敢于冒尖。");
		message.add("面对机遇，不犹豫;面对抉择，不彷徨;面对决战，不惧怕!");
		message.add("人的大脑和肢体一样，多用则灵，不用则废。");
		message.add("真正无愧自己的努力才是真的见证。");
	}

	public static List<String> getMessage() {
		return message;
	}
}
